import { _mock } from './_mock';

export const _quizzes = [
  {
    id: _mock.id(1),
    title: 'شخصیت شناسی',
    icon: 'ic-user',
    plan: {
      label: 'نسخه رایگان',
      title: 'free',
      has_access: true,
    },
    quizzes: [
      {
        created_at: '2025-09-11T13:06:19.657Z',
        updated_at: '2025-09-11T13:06:19.657Z',
        id: 1,
        title: 'آزمون شخصیت شناسی',
        description:
          '\nآیا کنجکاوید بدانید چه نوع شخصیتی در هیئت مدیره هستید؟ آزمون ۱۲۰ سواله "بردسنج" با یک مدل تایپ‌شناسی اختصاصی، شما را به یکی از پنج دسته‌بندی اصلی اعضای هیئت مدیره هدایت می‌کند: استراتژیست دوراندیش، تحلیلگر تیزبین، ارتباط‌گر توانمند، رهبر قاطع و ناظر ارزش‌مدار.\n\nاین آزمون فراتر از یک شخصیت‌شناسی ساده، به شما کمک می‌کند تا با ویژگی‌ها، مهارت‌ها و نقاط قوت و ضعف احتمالی خود در هر یک از این نقش‌های حیاتی آشنا شوید. شناخت جایگاهتان در این طیف، راهگشای رشد و اثربخشی شما در دنیای مدیریت ارشد خواهد بود.\n\nبا تکمیل سوالات، تحلیل جامعی دریافت خواهید کرد که نشان می‌دهد کدام نقش بیشترین همخوانی را با شما دارد. این نتایج صرفاً یک برچسب نیستند، بلکه نقشه راهی برای خودسازی و ارتقای مهارت‌های مدیریتی‌تان خواهند بود.\n\nفرصت را از دست ندهید؛ پتانسیل نهفته خود را در دنیای مدیریت ارشد با "بردسنج" کشف کنید!',
        type: 'شخصیت شناسی',
        duration: '۲۰ دقیقه',
        users: [],
        coverUrl: _mock.image.travel(1),
        indicators: [
          'وجهه مختلف نمرات اختصاصی دریافتی می کنند. ',
          'هر وجهه توسط ۴ سوال سنجیده می شود. سوالات همپوشانی ندارند ',
          'هر سوالی یک نمره یک تا پنج به وجهه مربوطه اضافه می کند.',
          'نمره خام به دست آمده برای هر وجهه از ۴ تا ۲۰ است.',
          'نمره به دست آمده از روی یک لوکاپ تیبل استانداردسازی می شود (۱۰ تا ۱۰۹).',
          'این وجهه ها ممکن است در آینده توسط آزمون های دیگر نیز محاسبه مجدد',
        ],
      },
      {
        created_at: '2025-09-13T13:45:47.231Z',
        updated_at: '2025-09-13T13:45:47.231Z',
        id: 2,
        title: 'مسئولیت های اصلی هیئت مدیره',
        description:
          'با نهایت احترام و آرزوی موفقیت، به آزمون ارزیابی مسئولیت‌های هیئت مدیره خوش آمدید. این آزمون با هدف بررسی و تحلیل میزان اثربخشی و کارایی هیئت مدیره در انجام وظایف کلیدی خود طراحی شده است. سوالات مطرح شده در این آزمون، حوزه‌های حیاتی همچون شفافیت مأموریت و چشم‌انداز، برنامه‌ریزی استراتژیک، رابطه هیئت مدیره و مدیریت عامل، برنامه‌ریزی جانشین پروری، مدیریت مالی، جمع‌آوری کمک مالی، اعتبار و تخصص، ارزیابی عملکرد و پاسخگویی را در بر می‌گیرد. پاسخ‌های صادقانه و دقیق شما به این سوالات، دیدگاهی جامع و ارزشمند از وضعیت فعلی هیئت مدیره ارائه خواهد داد و به شناسایی نقاط قوت و فرصت‌های بهبود کمک شایانی خواهد کرد. لطفاً با دقت به هر سوال پاسخ دهید. با تشکر.',
        type: 'مسئولیت ها',
        duration: '۱۰ دقیقه',
        users: [],
        coverUrl: _mock.image.travel(2),
        indicators: [
          'وجهه مختلف نمرات اختصاصی دریافتی می کنند. ',
          'هر وجهه توسط ۴ سوال سنجیده می شود. سوالات همپوشانی ندارند ',
          'هر سوالی یک نمره یک تا پنج به وجهه مربوطه اضافه می کند.',
          'نمره خام به دست آمده برای هر وجهه از ۴ تا ۲۰ است.',
          'نمره به دست آمده از روی یک لوکاپ تیبل استانداردسازی می شود (۱۰ تا ۱۰۹).',
          'این وجهه ها ممکن است در آینده توسط آزمون های دیگر نیز محاسبه مجدد',
        ],
      },
      {
        created_at: '2025-09-13T13:45:47.231Z',
        updated_at: '2025-09-13T13:45:47.231Z',
        id: 3,
        title: 'اثربخشی هیئت مدیره',
        description:
          'به آزمون جامع اثربخشی هیئت مدیره خوش آمدید. هدف این آزمون، ارزیابی دقیق و عمیق جنبه‌های مختلف عملکرد هیئت مدیره است تا به شما در شناسایی نقاط قوت و زمینه‌های قابل بهبود یاری رساند. در این ارزیابی، ما به بررسی ابعاد کلیدی از جمله اندازه و ساختار هیئت مدیره و کمیته‌های آن، ترکیب اعضا و تنوع، فرآیند جذب و آموزش اعضای جدید، رهبری هیئت مدیره و کیفیت ارتباط آن با مدیریت عامل، و نهایتاً فرآیندهای جلسات و میزان شور و اشتیاق اعضا خواهیم پرداخت. پاسخ‌های شما بینش‌های ارزشمندی را برای بهبود حاکمیت شرکتی و افزایش کارایی سازمان فراهم خواهد کرد. لطفاً با دقت و صداقت به هر سوال پاسخ دهید. با آرزوی موفقیت.',
        type: 'اثربخشی',
        duration: '۵ دقیقه\r',
        users: [],
        coverUrl: _mock.image.travel(3),
        indicators: [
          'وجهه مختلف نمرات اختصاصی دریافتی می کنند. ',
          'هر وجهه توسط ۴ سوال سنجیده می شود. سوالات همپوشانی ندارند ',
          'هر سوالی یک نمره یک تا پنج به وجهه مربوطه اضافه می کند.',
          'نمره خام به دست آمده برای هر وجهه از ۴ تا ۲۰ است.',
          'نمره به دست آمده از روی یک لوکاپ تیبل استانداردسازی می شود (۱۰ تا ۱۰۹).',
          'این وجهه ها ممکن است در آینده توسط آزمون های دیگر نیز محاسبه مجدد',
        ],
      },
      {
        created_at: '2025-09-13T13:45:47.231Z',
        updated_at: '2025-09-13T13:45:47.231Z',
        id: 4,
        title: 'نظر اعضا',
        description:
          'با رعایت احترام و صداقت، به نظرسنجی ناشناس از اعضای محترم هیئت مدیره خوش آمدید. این نظرسنجی با هدف جمع‌آوری دیدگاه‌های ارزشمند شما در مورد جنبه‌های مختلف حاکمیت شرکتی و عملکرد هیئت مدیره طراحی شده است. ارزیابی ما بر شفافیت اطلاعات، اثربخشی جلسات، کنترل ریسک، تعامل با مدیریت، ترکیب هیئت مدیره، و در نهایت، تعهد به منافع شرکت متمرکز خواهد بود. مشارکت شما در این نظرسنجی، که کاملاً ناشناس و محرمانه خواهد بود، به ما کمک می‌کند تا نقاط قوت را بشناسیم و زمینه‌هایی را که نیاز به بهبود دارند، تشخیص دهیم. لطفاً با ارائه نظرات صادقانه خود، ما را در مسیر بهبود مستمر عملکرد هیئت مدیره یاری رسانید. با تشکر از همکاری شما.',
        type: 'اثربخشی',
        duration: '۱۵ دقیقه\r',
        users: [],
        coverUrl: _mock.image.travel(4),
        indicators: [
          'وجهه مختلف نمرات اختصاصی دریافتی می کنند. ',
          'هر وجهه توسط ۴ سوال سنجیده می شود. سوالات همپوشانی ندارند ',
          'هر سوالی یک نمره یک تا پنج به وجهه مربوطه اضافه می کند.',
          'نمره خام به دست آمده برای هر وجهه از ۴ تا ۲۰ است.',
          'نمره به دست آمده از روی یک لوکاپ تیبل استانداردسازی می شود (۱۰ تا ۱۰۹).',
          'این وجهه ها ممکن است در آینده توسط آزمون های دیگر نیز محاسبه مجدد',
        ],
      },
      {
        created_at: '2025-09-13T13:45:47.231Z',
        updated_at: '2025-09-13T13:45:47.231Z',
        id: 5,
        title: 'مهارت های هیئت مدیره',
        description:
          'با سلام و احترام، به آزمون جامع "مهارت‌های هیئت مدیره" خوش آمدید. این آزمون با هدف ارزیابی و تحلیل عمق و گستره مهارت‌ها و تخصص‌های شما به عنوان عضوی از هیئت مدیره، در حوزه‌های کلیدی استراتژی و کسب‌وکار، مالی، ریسک و انطباق، عملیات و بازار، سرمایه انسانی و رهبری، و پایداری و اعتبار سازمانی طراحی شده است. ارزیابی دقیق مهارت‌ها نه تنها به خود شما در شناسایی نقاط قوت و زمینه‌های توسعه فردی کمک می‌کند، بلکه تصویری جامع از مجموعه مهارت‌های هیئت مدیره را برای سازمان فراهم می‌آورد. لطفاً با صداقت و دقت به سوالات این آزمون پاسخ دهید و میزان تسلط و تجربه خود را در هر یک از این حوزه‌ها بیان نمایید. نتایج این آزمون به ما در جهت بهبود اثربخشی کلی هیئت مدیره یاری خواهد رساند. با تشکر از همکاری شما.',
        type: 'مهارت ها',
        duration: '۲۰ دقیقه',
        users: [],
        coverUrl: _mock.image.travel(5),
        indicators: [
          'وجهه مختلف نمرات اختصاصی دریافتی می کنند. ',
          'هر وجهه توسط ۴ سوال سنجیده می شود. سوالات همپوشانی ندارند ',
          'هر سوالی یک نمره یک تا پنج به وجهه مربوطه اضافه می کند.',
          'نمره خام به دست آمده برای هر وجهه از ۴ تا ۲۰ است.',
          'نمره به دست آمده از روی یک لوکاپ تیبل استانداردسازی می شود (۱۰ تا ۱۰۹).',
          'این وجهه ها ممکن است در آینده توسط آزمون های دیگر نیز محاسبه مجدد',
        ],
      },
    ],
  },
  // {
  //   id: _mock.id(2),
  //   title: 'توانایی ها',
  //   icon: 'ic-tour',
  //   plan: {
  //     title: 'silver',
  //     label: 'نسخه نقره ای',
  //     has_access: false,
  //   },
  //   quizzes: [],
  // },
  // {
  //   id: _mock.id(),
  //   title: 'عملکرد',
  //   icon: 'ic-dashboard',
  //   plan: {
  //     title: 'gold',
  //     label: 'نسخه طلایی',
  //     has_access: false,
  //   },
  //   quizzes: [],
  // },
];

export const _quiz_result = {
  title: 'رهبر قاطع',
  subtitle: 'شما در قله امکان مدیر قاطع شدن هستید و باید تلاش کنید تا همراهی شروع کنید',
  description:
    'تیپ رهبر قاطع معاشرتی ، پویا و شاداب است و اغلب از خلق و خوی خوبی بر خوردار است . اشتیاق او به زندگی می‌تواند مسری باشد . این تیپ از قوه تصور و تخیل فراوان برخوردار بوده و ذهنی فعال دارد . روحیه‌اش پیوسته در حال تغییر است . در رسیدگی به جزئیات حتی در زمینه‌های مالی بی‌علاقه است . او می‌تواند رهبری باجذبه و الهام بخش باشد و با انرژی و پشتکار خود به دیگران انگیزه بدهد . تیپ ENFP می‌تواند روی پای خود بایستد و فکر کند .',
  description2:
    'تیپ ENFP در محل کار دوست دارد با سرعت خود کار کند و می‌خواهد نظارت بر او کمترین مقدار ممکن باشد . دنبال تنوع و چالش است و پیوسته در این فکر است که روش تخیلی را برای انجام دادن کارهایش انتخاب کند . این تیپ می‌تواند رهبری با جذبه و الهام‌بخش باشد . او می تواند با انرژی و پشتکار خود به دیگران انگیزه می‌دهد . دوست دارد با اشخاص خلاق و پر انرژی کار کند . برای افرادی مانند تیپ ENFP شروع کردن کار از تمام کردن آن اهمیت بیشتری دارد . وقتی درگیر پروژه خود می‌شود زمان و نیازهای جسمانی خود را فراموش می‌کند . این تیپ می‌تواند روی پای خود بایستد و فکر کند . در بسیاری از زمینه‌ها با استعداد است اما در کم کردن حیطه توجه خود با دشواری رو به رو می شود . او تحت تأثیر جزئیات کلافه می‌شود و ترجیح می دهد شخص دیگری به جزئیات رسیدگی کند .',
  comparission_with_average:
    'تیپ ENFP در محل کار دوست دارد با سرعت خود کار کند و می‌خواهد نظارت بر او کمترین مقدار ممکن باشد . دنبال تنوع و چالش است و پیوسته در این فکر است که روش تخیلی را برای انجام دادن کارهایش انتخاب کند . این تیپ می‌تواند رهبری با جذبه و الهام‌بخش باشد . او می تواند با انرژی و پشتکار خود به دیگران انگیزه می‌دهد . دوست دارد با اشخاص خلاق و پر انرژی کار کند . برای افرادی مانند تیپ ENFP شروع کردن کار از تمام کردن آن اهمیت بیشتری دارد . وقتی درگیر پروژه خود می‌شود زمان و نیازهای جسمانی خود را فراموش می‌کند . این تیپ می‌تواند روی پای خود بایستد و فکر کند . در بسیاری از زمینه‌ها با استعداد است اما در کم کردن حیطه توجه خود با دشواری رو به رو می شود . او تحت تأثیر جزئیات کلافه می‌شود و ترجیح می دهد شخص دیگری به جزئیات رسیدگی کند .',
};

export const _quiz_result_carousel = [
  {
    description:
      'مدافعان، محافظانی بسیار فداکار و خونگرم هستند و همیشه آماده دفاع از عزیزان خود می‌باشند. این افراد فروتن، کارآمد و مسئولیت‌پذیر هستند و همیشه در زندگی به دنبال عمل‌گرایی می‌باشند.',
    illustration: `analyst.svg`,
  },
  {
    description:
      'مدافعان، محافظانی بسیار فداکار و خونگرم هستند و همیشه آماده دفاع از عزیزان خود می‌باشند. این افراد فروتن، کارآمد و مسئولیت‌پذیر هستند و همیشه در زندگی به دنبال عمل‌گرایی می‌باشند.',
    illustration: `commiunicator.svg`,
  },
  {
    description:
      'مدافعان، محافظانی بسیار فداکار و خونگرم هستند و همیشه آماده دفاع از عزیزان خود می‌باشند. این افراد فروتن، کارآمد و مسئولیت‌پذیر هستند و همیشه در زندگی به دنبال عمل‌گرایی می‌باشند.',
    illustration: `loader.svg`,
  },
  {
    description:
      'مدافعان، محافظانی بسیار فداکار و خونگرم هستند و همیشه آماده دفاع از عزیزان خود می‌باشند. این افراد فروتن، کارآمد و مسئولیت‌پذیر هستند و همیشه در زندگی به دنبال عمل‌گرایی می‌باشند.',
    illustration: `observer.svg`,
  },
  {
    description:
      'مدافعان، محافظانی بسیار فداکار و خونگرم هستند و همیشه آماده دفاع از عزیزان خود می‌باشند. این افراد فروتن، کارآمد و مسئولیت‌پذیر هستند و همیشه در زندگی به دنبال عمل‌گرایی می‌باشند.',
    illustration: `strategist.svg`,
  },
];

export const _personality_types = [
  {
    title: 'محجوب',
    description:
      'این تیپ معمولا مخالف شدید عصبیت در مشکلات است. از طرفی به دلیل عدم پاسخ مناسب به تعارض و مشکل، دائما با احساس خود درگیر است و احساسش را آسیب‌دیده می‌بیند و از طرفی مایل نیست که ناراحتی و عصبیت خود را بروز دهد',
  },
  {
    title: 'آسان‌گیر',
    description:
      'این تیپ معمولا افراد بسیار آرامی هستند و اصلا علاقه‌مند نیستند كه عصبیت را از خود نشان دهند. معمولا افرادی با تاب‌آوری بالا و بسیار بخشنده هستند و اگر به آن‌ها بدی شود، به‌راحتی می‌بخشند و می‌گذرند. ',
  },
  {
    title: 'دمدمی',
    description:
      'این تیپ معمولا مخالف شدید عصبیت در مشکلات است. از طرفی به دلیل عدم پاسخ مناسب به تعارض و مشکل، دائما با احساس خود درگیر است و احساسش را آسیب‌دیده می‌بیند و از طرفی مایل نیست که ناراحتی و عصبیت خود را بروز دهد',
  },
  {
    title: 'خونسرد',
    description:
      'این تیپ معمولا افراد بسیار آرامی هستند و اصلا علاقه‌مند نیستند كه عصبیت را از خود نشان دهند. معمولا افرادی با تاب‌آوری بالا و بسیار بخشنده هستند و اگر به آن‌ها بدی شود، به‌راحتی می‌بخشند و می‌گذرند. ',
  },
];

export const _quiz_questions = [
  'در تعاملات حرفه‌ای، به دیگران اعتماد دارم و مفروضات مثبتی نسبت به نیت آنان دارم',
  'در تعاملات کاری، به نیت خیر و حسن نیت دیگران اعتماد دارم.',
  'در ارتباطات کاری، به گفته‌های دیگران اعتماد دارم، مگر اینکه خلاف آن اثبات شود.',
  'در تعاملات حرفه‌ای، به دیگران اعتماد دارم و مفروضات مثبتی نسبت به نیت آنان دارم',
  'در ارتباطات کاری، به گفته‌های دیگران اعتماد دارم، مگر اینکه خلاف آن اثبات شود.',
  'در تعاملات کاری، به نیت خیر و حسن نیت دیگران اعتماد دارم.',
  'در تعاملات کاری، به نیت خیر و حسن نیت دیگران اعتماد دارم.',
  'در ارتباطات کاری، به گفته‌های دیگران اعتماد دارم، مگر اینکه خلاف آن اثبات شود.',
  'در تعاملات حرفه‌ای، به دیگران اعتماد دارم و مفروضات مثبتی نسبت به نیت آنان دارم',
];
export const _quiz_responses = ['کاملا موافقم', 'موافقم', 'مطمئن نیستم', 'مخالفم', 'کاملا مخالفم'];
